emacs/emacs_default/functions.org
#+STARTUP: overview

* buffers
** my/eval-next-sexp
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/eval-next-sexp ()
  "Eval next sexp."
  (interactive)
  (sp-beginning-of-next-sexp)
  (sp-end-of-sexp)
  (eval-last-sexp nil))
  #+END_SRC
** make region read only
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun make-region-read-only (start end)
  (interactive "*r")
  (let ((inhibit-read-only t))
    (put-text-property start end 'read-only t)))

(defun make-region-read-write (start end)
  (interactive "*r")
  (let ((inhibit-read-only t))
    (put-text-property start end 'read-only nil)))
  #+END_SRC
** my/info
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/info ()
  (interactive)
  (info)
  (evil-emacs-state))
#+END_SRC
** my/kill-this-buffer
[[http://pragmaticemacs.com/emacs/dont-kill-buffer-my/kill-this-buffer-instead/][Source]].
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/kill-this-buffer ()
  "Kill the current buffer."
  (interactive)
  (kill-buffer (current-buffer)))
#+END_SRC
** focus
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun focus-emacs ()
  (interactive)
  (let ((inhibit-message t))
    (shell-command "~/scripts/i3_scripts/focus_emacs.sh")))

(defun focus-chrome ()
  (interactive)
  (let ((inhibit-message t))
    (shell-command "~/scripts/i3_scripts/focus_chrome.sh")))

(defun my/focus-chrome-delayed ()
  (interactive)
  (let ((inhibit-message t))
    (progn
      (sit-for 2)
      (shell-command "~/scripts/i3_scripts/focus_chrome.sh"))))
#+END_SRC
** my/yank-flush
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/yank-flush ()
  (interactive)
  (org-narrow-to-subtree)
  (yank)
  (flush-lines "^$"))

(defun my/yank-to-notes ()
  (interactive)
  (my/yank-region)
  (switch-to-buffer-other-window "bash_notes.org")
  (yas-expand-snippet dica))

#+END_SRC
** my/kill-buffer-and-workspace
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/kill-buffer-and-workspace ()
  (interactive)
  (widen)
  (my/save-all)
  (my/kill-this-buffer)
  (eyebrowse-close-window-config))
#+END_SRC
** org to docx
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun ox-export-to-docx-and-open ()
 "Export the current org file as a docx via markdown."
 (interactive)
 (let* ((bibfile (expand-file-name (car (org-ref-find-bibliography))))
        ;; this is probably a full path
        (current-file (buffer-file-name))
        (basename (file-name-sans-extension current-file))
        (docx-file (concat basename ".docx")))
   (save-buffer)
   (when (file-exists-p docx-file) (delete-file docx-file))
   (shell-command (format
                   "pandoc -s -S --bibliography=%s %s -o %s"
                   bibfile current-file docx-file))
   (org-open-file docx-file '(16))))
#+END_SRC
** my/term-emacs-state
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/term-emacs-state ()
  (interactive)
  (evil-force-normal-state)
  (evil-emacs-state))
#+END_SRC
** my/reload-keys
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/reload-keys ()
(interactive)
(load-file "~/.emacs.d/keys.el")
(message "keys reloaded"))
#+END_SRC
** org2blog
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/blog-post ()
  (interactive)
  (my/quiet-save-buffer)
  (disable-theme 'noctilux)
  (org2blog/wp-post-buffer)
  (load-theme 'noctilux)
  (delete-other-windows)
  (start-process-shell-command "chrome-reload-focus" nil "~/scripts/i3_scripts/chrome_reload.sh"))

(defun my/blog-publish ()
  (interactive)
  (my/quiet-save-buffer)
  (disable-theme 'noctilux)
  (org2blog/wp-post-buffer-and-publish)
  (load-theme 'noctilux)
  (delete-other-windows)
  (start-process-shell-command "chrome-reload-focus" nil "~/scripts/i3_scripts/chrome_reload.sh"))
#+END_SRC
** search my pack
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/search-pack ()
  (interactive)
  (let ((inhibit-message t))
    (find-file "~/.emacs.d/packs.org")
    (widen)
    (counsel-outline)))
#+END_SRC
** my my i3
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/search-pack ()
  (interactive)
  (let ((inhibit-message t))
    (find-file "~/.emacs.d/packs.org")
    (widen)
    (counsel-outline)))

(defun my/goto-i3-screen-configs ()
  (interactive)
  (let ((inhibit-message t))
    (find-file "~/.config/i3/config.org")
    (widen)
    (swiper "strachpads main")))
#+END_SRC
** pdf rotation
https://is.gd/leDMD5
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/pdf-view--rotate (&optional counterclockwise-p page-p)
  "Rotate PDF 90 degrees.  Requires pdftk to work.\n
Clockwise rotation is the default; set COUNTERCLOCKWISE-P to
non-nil for the other direction.  Rotate the whole document by
default; set PAGE-P to non-nil to rotate only the current page.
\nWARNING: overwrites the original file, so be careful!"
  ;; error out when pdftk is not installed
  (if (null (executable-find "pdftk"))
      (error "Rotation requires pdftk")
    ;; only rotate in pdf-view-mode
    (when (eq major-mode 'pdf-view-mode)
      (let* ((rotate (if counterclockwise-p "left" "right"))
	     (file   (format "\"%s\"" (pdf-view-buffer-file-name)))
	     (page   (pdf-view-current-page))
	     (pages  (cond ((not page-p)                        ; whole doc?
			    (format "1-end%s" rotate))
			   ((= page 1)                          ; first page?
			    (format "%d%s %d-end"
				    page rotate (1+ page)))
			   ((= page (pdf-info-number-of-pages)) ; last page?
			    (format "1-%d %d%s"
				    (1- page) page rotate))
			   (t                                   ; interior page?
			    (format "1-%d %d%s %d-end"
				    (1- page) page rotate (1+ page))))))
	;; empty string if it worked
	(if (string= "" (shell-command-to-string
			 (format (concat "pdftk %s cat %s "
					 "output %s.NEW "
					 "&& mv %s.NEW %s")
				 file pages file file file)))
	    (pdf-view-revert-buffer nil t)
	  (error "Rotation error!"))))))

(defun my/pdf-view-rotate-clockwise (&optional arg)
  "Rotate PDF page 90 degrees clockwise.  With prefix ARG, rotate
entire document."
  (interactive "P")
  (pdf-view--rotate nil (not arg)))

(defun my/pdf-view-rotate-counterclockwise (&optional arg)
  "Rotate PDF page 90 degrees counterclockwise.  With prefix ARG,
rotate entire document."
  (interactive "P")
  (pdf-view--rotate :counterclockwise (not arg)))
#+END_SRC
