emacs/emacs_default/functions.org
** reopen killed file
https://bit.ly/2VaDCFZ
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defvar my/kill-file-list nil
  "List of recently killed files.")

(defun my/add-file-to-killed-file-list ()
  "If buffer is associated with a file name, add that file to the
`my/kill-file-list' when killing the buffer."
  (when buffer-file-name
    (push buffer-file-name my/kill-file-list)))

(add-hook 'kill-buffer-hook #'my/add-file-to-killed-file-list)

(defun my/reopen-kill-file ()
  "Reopen the most recently killed file, if one exists."
  (interactive)
  (when my/kill-file-list
    (find-file (pop my/kill-file-list))))

(defun my/reopen-kill-file-fancy()
  "Pick a file to revisit from a list of files killed during this
Emacs session."
  (interactive)
  (if my/kill-file-list
      (let ((file (completing-read "Reopen killed file: " my/kill-file-list
                                   nil nil nil nil (car my/kill-file-list))))
        (when file
          (setq my/kill-file-list (cl-delete file my/kill-file-list :test #'equal))
          (find-file file)))
    (error "No recently-killed files to reopen")))
#+END_SRC
** go to warning
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/goto-warnings-buffer ()
(interactive)
(switch-to-buffer "*Warning*"))
#+END_SRC
** go to message
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/goto-messages-buffer ()
(interactive)
(switch-to-buffer "*Messages*"))
#+END_SRC
** killing and closing
*** my server edit
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/server-edit ()
(interactive)
(my/quiet-save-buffer)
(server-edit))
#+END_SRC
*** kill other buffers
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun kill-other-buffers ()
  "Kill all other buffers."
  (interactive)
  (mapc 'kill-buffer (delq (current-buffer) (buffer-list)))
  (delete-other-windows)
  (message " other buffers killed"))
#+END_SRC
*** kill all buffers
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun kill-all-buffers ()
  "Kill all buffers."
  (interactive)
  (progn
    (my/save-all)
    (mapc 'kill-buffer (delq (current-buffer) (buffer-list)))
    (my/kill-this-buffer)
    (delete-other-windows)
    (message " all buffers killed")))
#+END_SRC
** my man
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/man-follow (man-args)
  "Get a Un*x manual page of the item under point and put it in a buffer."
  (interactive (list (Man-default-man-entry)))
  (if (or (not man-args)
	  (string= man-args ""))
      (error "No item under point")
    (man man-args))
  (other-window 1)
  (delete-other-windows))

(defun my/push-button (&optional pos use-mouse-action)
  "Perform the action specified by a button at location POS.
POS may be either a buffer position or a mouse-event.  If
USE-MOUSE-ACTION is non-nil, invoke the button's `mouse-action'
property instead of its `action' property; if the button has no
`mouse-action', the value of `action' is used instead.

The action in both cases may be either a function to call or a
marker to display and is invoked using `button-activate' (which
see).

POS defaults to point, except when `push-button' is invoked
interactively as the result of a mouse-event, in which case, the
mouse event is used.
If there's no button at POS, do nothing and return nil, otherwise
return t."
  (interactive
   (list (if (integerp last-command-event) (point) last-command-event)))
  (if (and (not (integerp pos)) (eventp pos))
      ;; POS is a mouse event; switch to the proper window/buffer
      (let ((posn (event-start pos)))
	(with-current-buffer (window-buffer (posn-window posn))
	  (if (posn-string posn)
	      ;; mode-line, header-line, or display string event.
	      (button-activate (posn-string posn) t)
	    (push-button (posn-point posn) t))))
    ;; POS is just normal position
    (let ((button (button-at (or pos (point)))))
      (when button
	(button-activate button use-mouse-action)
	t)))
  (other-window 1)
  (delete-other-windows))

(defun my/Man-previous-section (n)
  "Move point to Nth previous section (default 1)."
  (interactive "p")
  (let ((case-fold-search nil))
    (if (looking-at Man-heading-regexp)
	(forward-line -1))
    (if (re-search-backward Man-heading-regexp (point-min) t n)
	(beginning-of-line)
      (goto-char (point-min)))))

(defun my/Man-next-section (n)
  "Move point to Nth next section (default 1)."
  (interactive "p")
  (let ((case-fold-search nil)
	(start (point)))
    (if (looking-at Man-heading-regexp)
	(forward-line 1))
    (if (re-search-forward Man-heading-regexp (point-max) t n)
	(beginning-of-line)
      (goto-char (point-max))
      ;; The last line doesn't belong to any section.
      (forward-line -1))
    ;; But don't move back from the starting point (can happen if `start'
    ;; is somewhere on the last line).
    (if (< (point) start) (goto-char start))))

(defun my-man()
  (interactive)
  (other-window -1)
  (line-numbers)
  (delete-other-windows)
  (centered-cursor-mode 1))

(defun my-tldr ()
  (interactive)
  (line-numbers)
  (delete-other-windows))

(defun my-man-kill ()
  (interactive)
  (Man-kill)
  (delete-frame))
#+END_SRC
