emacs/emacs_default/functions.org
** tangle
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(defun my/tangle-default ()
  (interactive)
  (widenToCenter)
  (my/quiet-save-buffer)
  (org-babel-tangle-file (prelude-copy-file-name-to-clipboard))
  (message "this file was tangled"))

(defun my/tangle-reload-keys ()
  (interactive)
  (my/quiet-save-buffer)
  (defvar foo)
  (setq foo (concat "tangle-py " (prelude-copy-file-name-to-clipboard)))
  (shell-command foo)
  (load-file "~/.emacs.d/keys.el")
  (message "keys reloaded"))

(defun tangle-py ()
  (interactive)
  (my/quiet-save-buffer)
  (defvar foo)
  (setq foo (concat "tangle-py " (prelude-copy-file-name-to-clipboard)))
  (shell-command foo)
  (message "this file was tangled"))

(defun tangle-and-eval-block-narrowed ()
  (interactive)
  (indent-block)
  (widenToCenter)
  (eval-src-block)
  (start-process-shell-command "tangle" nil "tangle-py ~/.emacs.d/*.org")
  (recursive-narrow-or-widen-dwim))

(defun my/reset-keys ()
  (interactive)
  (my/save-all)
  (shell-command "~/scripts/keyboard/init_keys.sh")
  (message "the keys were reseted"))

(defun tangle-py-all ()
  (interactive)
  (my/save-all)
  (shell-command "tangle-py ~/.emacs.d/*.org")
  (message "all files tangled"))

(defun tangle-and-eval-block ()
  (interactive)
  (indent-block)
  (my/save-all)
  (eval-src-block)
  (start-process-shell-command "tangle" nil "tangle-py ~/.emacs.d/*.org"))

(defun tangle-py-all-debug ()
  (interactive)
  (my/save-all)
  (start-process-shell-command "tangle init" nil "tangle-py ~/.emacs.d/*.org")
  (start-process-shell-command "new emacs" nil "emacs --debug-init"))

;; (defun tangle-py-all-recompile ()
;;   (interactive)
;;   (my/save-all)
;;   (shell-command "tangle-py ~/.emacs.d/*.org")
;;   (my/recompile)
;;   (message "all files tangled"))

(defun tangle-py-all-and-restart ()
  (interactive)
  (progn
    (my/save-all)
    (shell-command "tangle-py ~/.emacs.d/*.org")
    (sit-for 0.5)
    (shell-command "~/scripts/emacs_scripts/rel")))

(defun i3-reload ()
  (interactive)
  (my/save-all)

  (shell-command "tangle-py ~/.config/i3/*.org")
  (let ((inhibit-message t))
    (shell-command "i3-msg fullscreen disable ")
    (shell-command "i3-msg restart"))
  (message "i3 reloaded"))

(defun tangle-py-all-bug-hunter-init ()
  (interactive)
  (my/save-all)

  (shell-command "tangle-py ~/.emacs.d/*.org")
  (load-file user-init-file)
  (bug-hunter-init-file)
  (message "all files were tangled"))

(defun tangle-py-all-and-load ()
  (interactive)
  (my/save-all)

  (shell-command "tangle-py ~/.emacs.d/*.org")
  (load-file user-init-file)
  (message "all files tangled and loaded"))

(defun my/reload-init ()
  (interactive)
  (load-file user-init-file)
  (message "reloaded"))

;;;; TRIPLE CHECK ;;;;

(defun tangle-py-all-with-messages ()
  (interactive)
  (my/save-all)
  (async-shell-command "tangle-py ~/.emacs.d/*.org")
  (other-window -1)
  (evil-window-move-very-bottom)
  (adjust-term-c))

(defun my/save-all ()
  (interactive)
  (setq current-prefix-arg '(4))
  (call-interactively 'save-some-buffers))

(defun tangle-py-all-recompile-new-instance ()
  (interactive)
  (progn
    (my/save-all)
    (shell-command "tangle-py ~/.emacs.d/*.org")
    (my/recompile)
    (async-shell-command "emacs")
    (delete-windows-on "*Async Shell Command*")))

(defun my/recompile ()
  (interactive)
  (progn
    (byte-recompile-directory "~/.emacs.d")
    (delete-windows-on "*Compile-Log*")
    (message " recompiled")))
#+END_SRC
* Editing
** my transposes
*** my move lines
[[https://emacsredux.com/blog/2013/04/02/move-current-line-up-or-down/][Source]]
**** my/move-line-up
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-line-up ()
  (interactive)
  (transpose-lines 1)
  (forward-line -2))
#+END_SRC
**** my/move-line-down
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-line-down ()
  (interactive)
  (forward-line 1)
  (transpose-lines 1)
  (forward-line -1))
#+END_SRC
*** my move paragraphs
**** my/move-paragraph-down
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-paragraph-down ()
  (interactive)
  (transpose-paragraphs 1)
  (backward-paragraph)
  (next-line))
#+END_SRC
**** my/move-paragraph-up
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-paragraph-up ()
  (interactive)
  (transpose-paragraphs -1)
  (backward-paragraph)
  (next-line))
#+END_SRC
*** my move words
**** my/move-word-backwards
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-word-backwards ()
  (interactive)
  (backward-to-word 1)
  (transpose-words 1)
  (backward-word-strictly 2))
#+END_SRC
**** my/move-word-forward
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-word-forward ()
  (interactive)
  (forward-to-word 1)
  (transpose-words 1)
  (backward-word))
#+END_SRC
*** my move sentences
**** my/move-sentence-backwards
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-sentence-backward ()
  (interactive)
  (transpose-sentences 1)
  (backward-sentence 2))
#+END_SRC
**** my/move-sentence-forward
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-sentence-forward ()
  (interactive)
  (forward-sentence 1)
  (transpose-sentences 1)
  (backward-sentence))
#+END_SRC
*** my move regions
**** my/move-region-backwards
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-region-backward ()
  (interactive)
  (transpose-sentences 1)
  (backward-sentence 2))
#+END_SRC
**** my/move-region-forward
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-region-forward ()
  (interactive)
  (forward-sentence 1)
  (transpose-sentences 1)
  (backward-sentence))
#+END_SRC
*** my move sexp
**** my/move-sexp-backwards
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-sexp-backward ()
  (interactive)
  (transpose-sexps 1)
  (backward-sexp 2))
#+END_SRC
**** my/move-sexp-forward
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-sexp-forward ()
  (interactive)
  (forward-sexp 1)
  (transpose-sexps 1)
  (backward-sexp))
#+END_SRC
*** my move characters
**** my/move-character-backwards
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-character-backward ()
  (interactive)
  (transpose-chars 1)
  (backward-char 2))
#+END_SRC
**** my/move-character-forward
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/move-character-forward ()
  (interactive)
  (forward-char 1)
  (transpose-chars 1)
  (backward-char))
#+END_SRC
** my/insert-bash
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/insert-em-dash ()
  (interactive)
  (insert "—"))
#+END_SRC
** my/erase-kill-ring
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/erase-kill-ring ()
(interactive)
(setq kill-ring nil))
#+END_SRC
** my/insert-space
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/insert-space ()
  (interactive)
  (insert " "))
#+END_SRC
** my/swapped-insert
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/swapped-insert ()
  (interactive)
  (evil-append 1)
  (evil-swap-keys-mode 'toggle))

(defun my/swapped-disable ()
  (interactive)
  (evil-swap-keys-mode -1))

(defun my/swapped-enable ()
  (interactive)
  (evil-swap-keys-mode 1))
#+END_SRC
** my/org-started
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/org-started ()
  (interactive)
  (org-todo "STARTED")
  (org-clock-in))
#+END_SRC
** my/copy-to-line-end
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/copy-to-line-end ()
  (interactive)
  (evil-yank-line))
#+END_SRC
** my/append-to-visual-line
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/append-to-visual-line ()
(interactive)
(evil-end-of-visual-line)
(evil-insert-state))
#+END_SRC
** my/insert-to-visual-line
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/insert-to-visual-line ()
  (interactive)
  (evil-beginning-of-visual-line)
  (evil-insert-state))
#+END_SRC
** my/capitalize
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/capitalize ()
  (interactive)
  (fix-word-capitalize)
  (insert " "))
#+END_SRC
** undo to register
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(defun my/undo-to-x ()
  (interactive)
  (undo-tree-save-state-to-register 'x)
  (message " state 1 saved"))
(defun my/undo-restore-x ()
  (interactive)
  (undo-tree-restore-state-from-register 'x)
  (message " state 1 restored"))

(defun my/undo-to-y ()
  (interactive)
  (undo-tree-save-state-to-register 'y)
  (message " state 2 saved"))
(defun my/undo-restore-y ()
  (interactive)
  (undo-tree-restore-state-from-register 'y)
  (message " state 2 restored"))

(defun my/undo-to-z ()
  (interactive)
  (undo-tree-save-state-to-register 'z)
  (message " state 3 saved"))
(defun my/undo-restore-z ()
  (interactive)
  (undo-tree-restore-state-from-register 'z)
  (message " state 3 restored"))

#+END_SRC
