emacs/emacs_default/functions.org
** editing misc
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(defun indent-buffer-python ()
  (interactive)
  (save-excursion
    (let ((inhibit-message t))
      (evil-indent
       (point-min)
       (point-max)))))

(defun indent-buffer ()
  (interactive)
  (save-excursion
    (let ((inhibit-message t))
      (evil-indent
       (point-min)
       (point-max))
      (xah-clean-empty-lines))))

(defun copy-whole-buffer ()
  "Copy entire buffer to clipboard"
  (interactive)
  (clipboard-kill-ring-save
   (point-min)
   (point-max)))

(defun kill-buffer-contents ()
  (interactive)
  (kill-region
   (point-min)
   (point-max)))

(defun copy-to-chrome ()
  "Paste buffer on Chrome"
  (interactive)
  (copy-whole-buffer)
  (let ((inhibit-message t))
    (shell-command "~/scripts/i3_scripts/paste_to_chrome.sh")))

(defun copy-to-reddit ()
  "Paste buffer on reddit"
  (interactive)
  (copy-whole-buffer)
  (let ((inhibit-message t))
    (shell-command "/home/dave/org/Studying/Prog/Python/GUI/copy_to_reddit.py")))

(defun copy-to-tildes ()
  "Paste buffer on reddit"
  (interactive)
  (copy-whole-buffer)
  (let ((inhibit-message t))
    (shell-command "/home/dave/org/Studying/Prog/Python/GUI/copy_to_tildes.py")))

(defun copy-to-messenger ()
  (interactive)
  (copy-whole-buffer)
  (let ((inhibit-message t))
    (shell-command "~/scripts/i3_scripts/paste_to_im.sh")))

(defun my/unfill-paragraph (&optional region)
  "Takes a multi-line paragraph and makes it into a single line of text."
  (interactive (progn
		 (barf-if-buffer-read-only)
		 (list t)))
  (let ((fill-column (point-max)))
    (fill-paragraph nil region)))

(defun my/super-unfill-buffer ()
  (interactive)
  (save-excursion
    (mark-whole-buffer)
    (my/unfill-paragraph t)))

(defun my/super-fill-buffer ()
  (interactive)
  (fill-region
   (point-min)
   (point-max)))
#+END_SRC
** editing register
Prevents some operations to send content to the clipboard.
*** register main
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
;; (defmacro without-evil-mode (&rest do-this)
;;   ;; Check if evil-mode is on, and disable it temporarily
;;   `(let ((evil-mode-is-on (evil-mode?)))
;;      (if evil-mode-is-on
;;          (disable-evil-mode))
;;      (ignore-errors
;;        ,@do-this)
;;      (if evil-mode-is-on
;;          (enable-evil-mode))))

;; (defmacro evil-mode? ()
;;   "Checks if evil-mode is active. Uses Evil's state to check."
;;   `evil-state)

;; (defmacro disable-evil-mode ()
;;   "Disable evil-mode with visual cues."
;;   `(progn
;;      (evil-mode 0)
;;      (message "Evil mode disabled")))

;; (defmacro enable-evil-mode ()
;;   "Enable evil-mode with visual cues."
;;   `(progn
;;      (evil-mode 1)
;;      (message "Evil mode enabled")))
#+END_SRC
*** register clipboard bypassing
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
;; ;; delete: char
;; (evil-define-operator evil-destroy-char (beg end type register yank-handler)
;;   :motion evil-forward-char
;;   (evil-delete-char beg end type ?_))

;; ;; delete: char (backwards)
;; (evil-define-operator evil-destroy-backward-char (beg end type register yank-handler)
;;   :motion evil-forward-char
;;   (evil-delete-backward-char beg end type ?_))

;; ;; delete: text object
;; (evil-define-operator evil-destroy (beg end type register yank-handler)
;;   "Vim's 's' without clipboard."
;;   (evil-delete beg end type ?_ yank-handler))

;; ;; delete: to end of line
;; (evil-define-operator evil-destroy-line (beg end type register yank-handler)
;;   :motion nil
;;   :keep-visual t
;;   (interactive "<R><x>")
;;   (evil-delete-line beg end type ?_ yank-handler))

;; ;; delete: whole line
;; (evil-define-operator evil-destroy-whole-line (beg end type register yank-handler)
;;   :motion evil-line
;;   (interactive "<R><x>")
;;   (evil-delete-whole-line beg end type ?_ yank-handler))

;; ;; change: text object
;; (evil-define-operator evil-destroy-change (beg end type register yank-handler delete-func)
;;   (evil-change beg end type ?_ yank-handler delete-func))

;; ;; paste: before
;; (defun evil-destroy-paste-before ()
;;   (interactive)
;;   (without-evil-mode
;;    (delete-region (point) (mark))
;;    (evil-paste-before 1)))

;; ;; paste: after
;; (defun evil-destroy-paste-after ()
;;   (interactive)
;;   (without-evil-mode
;;    (delete-region (point) (mark))
;;    (evil-paste-after 1)))

;; ;; paste: text object
;; (evil-define-operator evil-destroy-replace (beg end type register yank-handler)
;;   (evil-destroy beg end type register yank-handler)
;;   (evil-paste-before 1 register))
#+END_SRC
** truncate-off
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/truncate-off ()
(interactive)
(setq truncate-lines nil))

(defun my/truncate-on ()
(interactive)
(setq truncate-lines t))

#+END_SRC
** company
*** company make ispell
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/company-ispell-en ()
  (interactive)
  (set (make-local-variable 'company-backends)
       '(company-ispell company-dabbrev company-dabbrev-code))
  (setq-local company-ispell-dictionary nil)
  (setq-local company-tooltip-limit 8)
  (setq-local company-idle-delay 0.4)
  (setq-local company-minimum-prefix-length 3)
  (message " company-ispell-en enabled"))

(defun my/company-ispell-pt ()
  (interactive)
  (set (make-local-variable 'company-backends)
       '(company-ispell company-dabbrev company-dabbrev-code))
  (set (make-local-variable 'company-ispell-dictionary)
       (file-truename "~/.emacs.d/etc/ptBR-2013-10-30AOC-2/pt_BR.txt"))
  (setq-local company-tooltip-limit 8)
  (setq-local company-idle-delay 0.2)
  (setq-local company-minimum-prefix-length 3)
  (message " company-ispell-pt enabled"))

(defun my/company-defaults ()
  (interactive)
  (setq company-backends '(company-bbdb company-eclim company-semantic company-clang company-xcode company-cmake company-capf company-files (company-dabbrev-code company-gtags company-etags company-keywords) company-oddmuse company-dabbrev company-shell))
  (message " company-defaults"))

(defun my/company-prose ()
  (interactive)
  (setq-local company-backends '(company-bbdb company-eclim company-semantic company-clang company-xcode company-cmake company-capf company-files (company-dabbrev-code company-gtags company-etags company-keywords) company-oddmuse company-dabbrev company-shell))
  (setq-local company-tooltip-limit 5)
  (setq-local company-idle-delay 0.0)
  (setq-local company-minimum-prefix-length 3)
  (message " company-prose"))

#+END_SRC
