emacs/emacs_default/functions.el

(defun backward-kill-line (arg)
  "Kill ARG lines backward."
  (interactive "p")
  (kill-line (- 1 arg)))

(defun brasileiro ()
(interactive)
(ispell-change-dictionary "brasileiro")
(flyspell-buffer)
(message " português"))

(defun american ()
(interactive)
(ispell-change-dictionary "american")
(flyspell-buffer)
(message " american"))

;; https://stackoverflow.com/a/30697761/9509067
(defun sort-lines-by-length (reverse beg end)
  "Sort lines by length."
  (interactive "P\nr")
  (save-excursion
    (save-restriction
      (narrow-to-region beg end)
      (goto-char (point-min))
      (let ;; To make `end-of-line' and etc. to ignore fields.
          ((inhibit-field-text-motion t))
        (sort-subr reverse 'forward-line 'end-of-line nil nil
                   (lambda (l1 l2)
                     (apply #'< (mapcar (lambda (range) (- (cdr range) (car range)))
                                        (list l1 l2)))))))))

(defun my/par-justify-59 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 59j1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/par-justify-79 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 79j1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/par-justify-85 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 85j1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/par-justify-95 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 95j1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/par-justify-100 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 105j1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/par-fit-59 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 59f1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/par-fit-79 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 79f1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/par-fit-85 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 85f1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/par-fit-95 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 95f1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/par-fit-100 (&optional _justify)
  "Invoke shell command `par' on the current paragraph."
  (interactive)
  (save-excursion
    (mark-paragraph)
    (forward-whitespace 1)
    (shell-command-on-region (point) (mark) "par 125f1g1" nil :replace))
  t) ;; Don't return nil. See variable `fill-paragraph-function'.

(defun my/next-sentence ()
  (interactive)
  (evil-forward-sentence-begin)
  (beacon-blink))

(defun my/prev-sentence ()
  (interactive)
  (evil-backward-sentence-begin)
  (beacon-blink))

(defun widenToCenter ()
  (interactive)
  (save-excursion
    (widen)
    (recenter)))

(defun my/paragraph-backwards ()
  (interactive)
  (previous-line)
  (backward-paragraph)
  (next-line)
  (back-to-indentation))

(defun my/paragraph-forward ()
  (interactive)
  (forward-paragraph)
  (next-line)
  (back-to-indentation))

(defun my/markdown-forward-paragraph ()
(interactive)
(markdown-forward-paragraph)
(forward-to-indentation))

(defun last-buffer ()
  "Switch to previously open buffer.
Repeated invocations toggle between the two most recently open buffers."
  (interactive)
  (switch-to-buffer (other-buffer (current-buffer) 1)))


(defun my/goto-pdf-window ()
  (interactive)
  (let ((which-key-inhibit t))
    (switch-to-buffer-other-window "bash_guide.pdf")))

(defun my/goto-bash-notes ()
  (interactive)
  (let ((which-key-inhibit t))
    (switch-to-buffer-other-window "bash_notes.org")))

(defun my/goto-shell-window ()
  (interactive)
  (let ((which-key-inhibit t))
    (switch-to-buffer-other-window "*shell*")))



(defun my/window-to-register-91 ()
  (interactive)
  (window-configuration-to-register 91)
  (message " layout saved"))

(defun my/jump-to-register-91 ()
  (interactive)
  (jump-to-register 91)
  (message " layout 1 restored"))

(defun my/window-to-register-nine ()
  (interactive)
  (window-configuration-to-register 99)
  (message " layout 1 saved"))

(defun my/jump-to-register-nine ()
  (interactive)
  (jump-to-register 99)
  (message " layout 1 restored"))

(defun my/window-to-register-eight ()
  (interactive)
  (window-configuration-to-register 88)
  (message " layout 2 saved"))

(defun my/jump-to-register-eight ()
  (interactive)
  (jump-to-register 88)
  (message " layout 2 restored"))

(defun my/window-to-register-sevenseven ()
  (interactive)
  (window-configuration-to-register 77)
  (message " layout 7 saved"))

(defun my/jump-to-register-sevenseven ()
  (interactive)
  (jump-to-register 55)
  (message " layout 7 restored"))

(defun my/window-to-register-fivefive ()
  (interactive)
  (window-configuration-to-register 55))

(defun my/jump-to-register-fivefive ()
  (interactive)
  (jump-to-register 55))


(defun text-scale-reset ()
  (interactive)
  (text-scale-adjust 0)
  (message ""))

(defun disable-modeline ()
  (interactive)
  (setq-local mode-line-format nil))
