emacs/emacs_default/functions.org
** conf mode
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(defun my/conf-hooks ()
  (interactive)
  (line-numbers)
  (subword-mode 1)
  (company-mode 1)
  (flycheck-mode 1)
  (smartparens-mode 1)
  (tab-jump-out-mode 1)
  (electric-operator-mode 1)
  (rainbow-delimiters-mode 1)
  (electric-pair-local-mode 1)
  (highlight-numbers-mode 1)
  (highlight-operators-mode 1)
  (highlight-indent-guides-mode 1)
  (electric-pair-local-mode 1)
  (subword-mode 1)
  (tab-jump-out-mode 1))

(add-hook 'conf-space-mode-hook 'my/conf-hooks)
#+END_SRC
** man mode
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(defun my/man-follow (man-args)
  "Get a Un*x manual page of the item under point and put it in a buffer."
  (interactive (list (Man-default-man-entry)))
  (if (or (not man-args)
	  (string= man-args ""))
      (error "No item under point")
    (man man-args))
(other-window 1)
(delete-other-windows))

(defun my/push-button (&optional pos use-mouse-action)
  "Perform the action specified by a button at location POS.
POS may be either a buffer position or a mouse-event.  If
USE-MOUSE-ACTION is non-nil, invoke the button's `mouse-action'
property instead of its `action' property; if the button has no
`mouse-action', the value of `action' is used instead.

The action in both cases may be either a function to call or a
marker to display and is invoked using `button-activate' (which
see).

POS defaults to point, except when `push-button' is invoked
interactively as the result of a mouse-event, in which case, the
mouse event is used.
If there's no button at POS, do nothing and return nil, otherwise
return t."
  (interactive
   (list (if (integerp last-command-event) (point) last-command-event)))
  (if (and (not (integerp pos)) (eventp pos))
      ;; POS is a mouse event; switch to the proper window/buffer
      (let ((posn (event-start pos)))
	(with-current-buffer (window-buffer (posn-window posn))
	  (if (posn-string posn)
	      ;; mode-line, header-line, or display string event.
	      (button-activate (posn-string posn) t)
	    (push-button (posn-point posn) t))))
    ;; POS is just normal position
    (let ((button (button-at (or pos (point)))))
      (when button
	(button-activate button use-mouse-action)
	t)))
(other-window 1)
(delete-other-windows))

(defun my/Man-previous-section (n)
  "Move point to Nth previous section (default 1)."
  (interactive "p")
  (let ((case-fold-search nil))
    (if (looking-at Man-heading-regexp)
	(forward-line -1))
    (if (re-search-backward Man-heading-regexp (point-min) t n)
	(beginning-of-line)
      (goto-char (point-min)))))

(defun my/Man-next-section (n)
  "Move point to Nth next section (default 1)."
  (interactive "p")
  (let ((case-fold-search nil)
        (start (point)))
    (if (looking-at Man-heading-regexp)
	(forward-line 1))
    (if (re-search-forward Man-heading-regexp (point-max) t n)
	(beginning-of-line)
      (goto-char (point-max))
      ;; The last line doesn't belong to any section.
      (forward-line -1))
    ;; But don't move back from the starting point (can happen if `start'
    ;; is somewhere on the last line).
    (if (< (point) start) (goto-char start))))

(defun my/man()
  (interactive)
  (other-window -1)
  (line-numbers)
  (delete-other-windows)
  (centered-cursor-mode 1))

(defun my/man-kill ()
  (interactive)
  (Man-kill)
  (delete-frame))
#+END_SRC
** pdf mode
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el


(defun my/pdf-goto-start ()
  (interactive)
  (let ((which-key-inhibit t))
    (windmove-left)
    (pdf-view-first-page)
    (my/previous-window)))

(defun my/pdf-goto-end ()
  (interactive)
  (let ((which-key-inhibit t))
    (windmove-left)
    (pdf-view-last-page)
    (my/previous-window)))

(defun my/pdf-shrink ()
  (interactive)
  (let ((which-key-inhibit t))
    (windmove-left)
    (pdf-view-shrink 1.25)
    (my/previous-window)))

(defun my/pdf-enlarge ()
  (interactive)
  (let ((which-key-inhibit t))
    (windmove-left)
    (pdf-view-enlarge 1.25)
    (my/previous-window)))

(defun my/down-pdf-window ()
  (interactive)
  (let ((which-key-inhibit t))
    (windmove-left)
    (pdf-view-scroll-up-or-next-page)
    (other-window -1)))

(defun my/up-pdf-window ()
  (interactive)
  (let ((which-key-inhibit t))
    (windmove-left)
    (pdf-view-scroll-down-or-previous-page)
    (other-window -1)))

(defun my/pdf-next-page-other-window ()
  (interactive)
  (let ((which-key-inhibit t))
    (windmove-left)
    (pdf-view-next-page)
    (other-window -1)))

(defun my/pdf-prev-page-other-window ()
  (interactive)
  (let ((which-key-inhibit t))
    (windmove-left)
    (pdf-view-previous-page)
    (other-window -1)))

#+END_SRC
** edit abbrevs mode
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun abbrev-edit-save-close ()
  (interactive)
  (abbrev-edit-save-buffer)
  (my/kill-this-buffer))
#+END_SRC
** sh mode
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(defun my/sh-mode-hooks ()
  (interactive)
  (line-numbers)
  (subword-mode 1)
  (company-mode 1)
  (smartparens-mode 1)
  (tab-jump-out-mode 1)
  (flycheck-mode 1)
  (electric-pair-local-mode 1)
  (yas-minor-mode 1)
  (highlight-indent-guides-mode 1)
  (aggressive-indent-mode 1)
  (beacon-mode 1)
  (message " my sh-mode on"))

#+END_SRC
** eww mode
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/quiet-shr-next-link ()
  (interactive)
  (let ((inhibit-message t)) (shr-next-link)))

(defun my/quiet-shr-prev-link ()
  (interactive)
  (let ((inhibit-message t)) (shr-previous-link)))
#+END_SRC
** org mode
*** org open link in other frame
https://stackoverflow.com/questions/8881649/how-to-force-org-mode-to-open-a-link-in-another-frame
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.El

(defun zin/org-open-other-frame ()
  "Jump to bookmark in another frame. See `bookmark-jump' for more."
  (interactive)
  (let ((org-link-frame-setup (acons 'file 'find-file-other-frame org-link-frame-setup)))
    (org-open-at-point)))

(defun zin/org-open-other-window ()
  (interactive)
  (let ((org-link-frame-setup (acons 'file 'find-file-other-window org-link-frame-setup)))
    (org-open-at-point)))

#+END_SRC

*** org open quiet
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(defun org-open-quiet ()
  (interactive)
  (let ((inhibit-message t)) (org-open-at-point)))

#+END_SRC
*** org hide other
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun org-hide-other ()
  (interactive)
  (point-to-register 'z)
  (org-shifttab)
  (jump-to-register 'z)
  (org-cycle)
  (outline-show-subtree)
  (message ""))
#+END_SRC
*** org agenda
Shows the agenda for the different days.
**** org agenda
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/org-agenda ()
  (interactive)
  (org-agenda t "a"))
#+END_SRC
**** org 1 day agenda
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun org-1-day-agenda ()
  (interactive)
  (let ((current-prefix-arg 1))
    (org-agenda t "a")))
#+END_SRC

#+RESULTS:
: org-1-day-agenda

**** org 2 days agenda
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun org-2-days-agenda ()
  (interactive)
  (let ((current-prefix-arg 2))
    (org-agenda t "a")))
#+END_SRC
**** org 3 days agenda
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun org-3-days-agenda ()
  (interactive)
  (let ((current-prefix-arg 3))
    (org-agenda t "a")))
#+END_SRC
**** org 4 days agenda
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun org-4-days-agenda ()
  (interactive)
  (let ((current-prefix-arg 4))
    (org-agenda t "a")))
#+END_SRC
**** org 5 days agenda
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun org-5-days-agenda ()
  (interactive)
  (let ((current-prefix-arg 5))
    (org-agenda t "a")))
#+END_SRC
**** org 6 days agenda
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun org-6-days-agenda ()
  (interactive)
  (let ((current-prefix-arg 6))
    (org-agenda t "a")))
#+END_SRC
**** org 7 days agenda
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun org-7-days-agenda ()
  (interactive)
  (let ((current-prefix-arg 7))
    (org-agenda t "a")))
#+END_SRC
**** org agenda enter
Open org-agenda item in the same window.
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/agenda-enter ()
  (interactive)
  (let ((current-prefix-arg 4))
    (org-agenda-switch-to)))
#+END_SRC
*** org toggle emphasis
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun org-hide-emphasis ()
  (interactive)
  (save-excursion
    (setq org-hide-emphasis-markers t)
    (let ((inhibit-message t))
      (org-mode-restart)
      (org-cycle))))

(defun org-show-emphasis ()
  (interactive)
  (save-excursion
    (setq org-hide-emphasis-markers nil)
    (let ((inhibit-message t))
      (org-mode-restart)
      (org-cycle))))
#+END_SRC
*** org editing
