emacs/emacs_default/functions.org
**** xah cycle buffers
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun xah-next-user-buffer ()
  "Switch to the next user buffer.
“user buffer” is determined by `xah-user-buffer-q'.
URL `http://ergoemacs.org/emacs/elisp_next_prev_user_buffer.html'
Version 2016-06-19"
  (interactive)
  (next-buffer)
  (let ((i 0))
    (while (< i 20)
      (if (not (xah-user-buffer-q))
          (progn (next-buffer)
                 (setq i (1+ i)))
        (progn (setq i 100))))))

(defun xah-previous-user-buffer ()
  "Switch to the previous user buffer.
“user buffer” is determined by `xah-user-buffer-q'.
URL `http://ergoemacs.org/emacs/elisp_next_prev_user_buffer.html'
Version 2016-06-19"
  (interactive)
  (previous-buffer)
  (let ((i 0))
    (while (< i 20)
      (if (not (xah-user-buffer-q))
          (progn (previous-buffer)
                 (setq i (1+ i)))
        (progn (setq i 100))))))

(defun xah-next-emacs-buffer ()
  "Switch to the next emacs buffer.
“emacs buffer” here is buffer whose name starts with *.
URL `http://ergoemacs.org/emacs/elisp_next_prev_user_buffer.html'
Version 2016-06-19"
  (interactive)
  (next-buffer)
  (let ((i 0))
    (while (and (not (string-equal "*" (substring (buffer-name) 0 1))) (< i 20))
      (setq i (1+ i)) (next-buffer))))

(defun xah-previous-emacs-buffer ()
  "Switch to the previous emacs buffer.
“emacs buffer” here is buffer whose name starts with *.
URL `http://ergoemacs.org/emacs/elisp_next_prev_user_buffer.html'
Version 2016-06-19"
  (interactive)
  (previous-buffer)
  (let ((i 0))
    (while (and (not (string-equal "*" (substring (buffer-name) 0 1))) (< i 20))
      (setq i (1+ i)) (previous-buffer))))

(defun xah-user-buffer-q ()
  "Return t if current buffer is a user buffer, else nil.
Typically, if buffer name starts with *, it's not considered a user buffer.
This function is used by buffer switching command and close buffer command, so that next buffer shown is a user buffer.
You can override this function to get your idea of “user buffer”.
version 2016-06-18"
  (interactive)
  (if (string-equal "*" (substring (buffer-name) 0 1))
      nil
    (if (string-equal major-mode "dired-mode")
        nil
      t)))
#+END_SRC
*** xmodmap mode
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(define-generic-mode 'xmodmap-mode
  '(?!)
  '("add" "clear" "keycode" "keysym" "pointer" "remove")
  nil
  '("[xX]modmap.*\\(rc\\)?\\'")
  nil
  "Simple mode for xmodmap files.")
#+END_SRC
*** title time mode
https://www.emacswiki.org/emacs/title-time.el
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(setq display-time-default-load-average nil)
(setq display-time-format "%H:%M")

(require 'time)

(defvar title-time-mode t
  "This is set to t iff we are displaying the current time in the title bar.")

(defun title-time-set ()
  "Set `frame-title-format' to the local system name followed by date,
time, and load information (as per `display-time-string-forms') and perhaps
followed by an appointment notification."
  (setq frame-title-format '(" " display-time-string)))

(defun title-time-update ()
  "Update the time display in the title-bar.
Skips inferior frames, that is, those without a minibuffer (eg. speedbar). "
  (interactive)
  ;; remove time display from the mode line
  (delq 'display-time-string global-mode-string)
  (delq 'appt-mode-string global-mode-string)
  (let ((start-frame (selected-frame)))
    (save-excursion
      (save-window-excursion
        (let ((my/frame-list (frame-list))
              (my/frame nil))
          (while (setq my/frame (car my/frame-list))
            (when (frame-parameter my/frame 'minibuffer)
              '(select-frame my/frame)
              (title-time-set))
            (setq my/frame-list (cdr my/frame-list))))))
    (select-frame start-frame)))

(add-hook 'display-time-hook #'title-time-update)

(display-time-mode 1)

(provide 'title-time)
(require 'title-time)

;;; title-time.el ends here
#+END_SRC
** my vlf mode
Provides a major-mode for the i3/config file.
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(define-derived-mode mv fundamental-mode

  (defun mv-hooks ()
    (setq display-line-numbers nil)
    (abbrev-mode -1)
    (vlf-mode 1))

  (add-hook 'mv-hook 'mv-hooks)

  (provide 'mv))

(general-define-key
 :keymaps 'mv-map
 "M-p" 'my/paragraph-backwards
 "M-n" 'my/paragraph-forward
 "<prior>" 'down-five
 "<next>" 'up-five)

(general-unbind 'mv-map
  :with 'ignore
  [remap my/quiet-save-buffer])

#+END_SRC
*** org kill agenda files
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defvar opened-org-agenda-files nil)

(defun opened-org-agenda-files ()
  (let ((files (org-agenda-files)))
    (setq opened-org-agenda-files nil)
    (mapcar
     (lambda (x)
       (when (get-file-buffer x)
	 (push x opened-org-agenda-files)))
     files)))

(defun kill-org-agenda-files ()
  (interactive)
  (let ((files (org-agenda-files)))
    (mapcar
     (lambda (x)
       (when
	   (and
	    (get-file-buffer x)
	    (not (member x opened-org-agenda-files)))
	 (kill-buffer (get-file-buffer x))))
     files)))

(defadvice org-agenda-list (around opened-org-agenda-list-around activate)
  (opened-org-agenda-files)
  ad-do-it
  (kill-org-agenda-files))

(defadvice org-search-view (around org-search-view-around activate)
  (opened-org-agenda-files)
  ad-do-it
  (kill-org-agenda-files))

(defadvice org-tags-view (around org-tags-view-around activate)
  (opened-org-agenda-files)
  ad-do-it
  (kill-org-agenda-files))
#+END_SRC
* misc
** quiet save
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/quiet-save-buffer () (interactive)
       (save-excursion
	 (evil-ex-nohighlight)
	 (let ((inhibit-message t))
	   (delete-trailing-whitespace)
	   (save-buffer))))

(defun my/quiet-save-buffer-markdown () (interactive)
       (save-excursion
	 (evil-ex-nohighlight)
	 (let ((inhibit-message t))
	   (save-buffer))))

;; (defun my/quiet-save-python () (interactive)
;;        (evil-ex-nohighlight)
;;        (let ((inhibit-message t))
;; 	 (progn
;; 	   (elpy-autopep8-fix-code)
;; 	   (elpy-black-fix-code)
;; 	   (save-buffer))))

#+END_SRC
** date
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/date ()
  (interactive)
  (save-excursion
    (shell-command "date")))
#+END_SRC
** wc analysis
https://www.emacswiki.org/emacs/WordCount#toc8
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun word-count-analysis (start end)
  "Count how many times each word is used in the region.
    Punctuation is ignored."
  (interactive "r")
  (let (words)
    (save-excursion
      (goto-char start)
      (while (re-search-forward "\\w+" end t)
        (let* ((word (intern (match-string 0)))
               (cell (assq word words)))
          (if cell
              (setcdr cell (1+ (cdr cell)))
            (setq words (cons (cons word 1) words))))))
    (when (interactive-p)
      (message "%S" words))
    words))
#+END_SRC
** show major mode
Open term in the very bottom.
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun show-major-mode ()
  (interactive)
  (describe-variable 'major-mode))
#+END_SRC
** show server
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(defun show-server ()
  (interactive)
  (describe-variable 'server-name))

#+END_SRC
** show fill colum
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun show-fill-column ()
  (interactive)
  (describe-variable 'fill-column))
#+END_SRC
** delete file and buffer
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun delete-file-and-buffer ()
  (interactive)
  (let ((filename (buffer-file-name)))
    (when filename
   (if (vc-backend filename)
          (vc-delete-file filename)
        (progn
          (delete-file filename)
          (message "Deleted file %s" filename)
          (kill-buffer))))))
#+END_SRC
** trash file
Kill the current buffer and deletes the file it is visiting.
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el

(defun my/move-file-to-trash ()
  (interactive)
  (move-file-to-trash (buffer-name))
  (kill-buffer)
  (delete-window))

(defun my/move-file-to-trash-close-ws ()
  (interactive)
  (move-file-to-trash (buffer-name))
  (kill-buffer)
  (eyebrowse-close-window-config))

#+END_SRC
** toggle cursor
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun enable-cursor ()
  (interactive)
  (setq cursor-type t))

(defun disable-cursor ()
  (interactive)
  (setq cursor-type nil))
#+END_SRC
