emacs/emacs_default/functions.org
** themes
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun noctilux-on ()
  (interactive)
  (my/disable-current-theme)
  (load-theme 'noctilux))

(defun poet-dark-on ()
  (interactive)
  (my/disable-current-theme)
  (load-theme 'poet-dark))

(defun poet-dark-monochrome-on ()
  (interactive)
  (my/disable-current-theme)
  (load-theme 'poet-dark-monochrome))

(defun my/new-theme ()
  (interactive)
  (my/disable-current-theme)
  (counsel-load-theme))

#+END_SRC
** fountain export shell
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/fountain-export ()
(interactive)
(fountain-export-shell-command)
(quit-windows-on "*Fountain Export Process*"))
#+END_SRC
** eval block
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun eval-src-block ()
  (interactive)
  (org-edit-special nil)
  (eval-buffer)
  (org-edit-src-exit))
#+END_SRC
** eval buffer
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/eval-buffer ()
  (interactive)
  (my/quiet-save-buffer)
  (eval-buffer)
  (message "buffer evaluated"))
#+END_SRC
* external
** my/hide-all
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun i3-hide-all ()
  (interactive)
  (let ((inhibit-message t))
    (shell-command "~/scripts/i3_scripts/hide/hide_all")))
#+END_SRC
** my/ranger
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/ranger ()
  (interactive)
  (my/copy-dir)
  (start-process-shell-command "my/show-ranger" nil "~/scripts/emacs_scripts/show-ranger"))
#+END_SRC
** my/terminal
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/functions.el
(defun my/terminal ()
  (interactive)
  (my/copy-dir)
  (start-process-shell-command "my/show-ranger" nil "~/scripts/emacs_scripts/show-term"))
#+END_SRC
** line numbers
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/init.el
(defun line-numbers ()
  (interactive)
  (setq display-line-numbers 'visual)
  (setq display-line-numbers-widen nil)
  (setq display-line-numbers-current-absolute nil))

(defun line-numbers-absolute ()
  (interactive)
  (setq display-line-numbers 'visual)
  (setq display-line-numbers-widen nil)
  (setq display-line-numbers-current-absolute t))

(defun noct:relative ()
  (setq-local display-line-numbers 'visual))

(defun noct:absolute ()
  (setq-local display-line-numbers t))
(custom-set-faces '(line-number-current-line ((t :weight bold
                                                 :foreground "goldenrod"
                                                 :background "slate gray"))))
(defun line-no-numbers ()
  (interactive)
  (setq display-line-numbers nil))
#+END_SRC
