emacs/emacs_default/functions.el

(defun noctilux-on ()
  (interactive)
  (my/disable-current-theme)
  (load-theme 'noctilux))

(defun poet-dark-on ()
  (interactive)
  (my/disable-current-theme)
  (load-theme 'poet-dark))

(defun poet-dark-monochrome-on ()
  (interactive)
  (my/disable-current-theme)
  (load-theme 'poet-dark-monochrome))

(defun my/new-theme ()
  (interactive)
  (my/disable-current-theme)
  (counsel-load-theme))


(defun my/fountain-export ()
(interactive)
(fountain-export-shell-command)
(quit-windows-on "*Fountain Export Process*"))

(defun eval-src-block ()
  (interactive)
  (org-edit-special nil)
  (eval-buffer)
  (org-edit-src-exit))

(defun my/eval-buffer ()
  (interactive)
  (my/quiet-save-buffer)
  (eval-buffer)
  (message "buffer evaluated"))

(defun i3-hide-all ()
  (interactive)
  (let ((inhibit-message t))
    (shell-command "~/scripts/i3_scripts/hide/hide_all")))

(defun my/ranger ()
  (interactive)
  (my/copy-dir)
  (start-process-shell-command "my/show-ranger" nil "~/scripts/emacs_scripts/show-ranger"))

(defun my/terminal ()
  (interactive)
  (my/copy-dir)
  (start-process-shell-command "my/show-ranger" nil "~/scripts/emacs_scripts/show-term"))
